zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_event.h
//*****************************************************************************
//
// Register: EVENT_O_UDMACH4SSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SSI0_TX_DMASREQ          SSI0 TX DMA single request, controlled by
//                          SSI0:DMACR.TXDMAE
#define EVENT_UDMACH4SSEL_EV_W                                               7
#define EVENT_UDMACH4SSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH4SSEL_EV_S                                               0
#define EVENT_UDMACH4SSEL_EV_SSI0_TX_DMASREQ                        0x0000002B

//*****************************************************************************
//
// Register: EVENT_O_UDMACH4BSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// SSI0_TX_DMABREQ          SSI0 TX DMA burst request , controlled by
//                          SSI0:DMACR.TXDMAE
#define EVENT_UDMACH4BSEL_EV_W                                               7
#define EVENT_UDMACH4BSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH4BSEL_EV_S                                               0
#define EVENT_UDMACH4BSEL_EV_SSI0_TX_DMABREQ                        0x0000002A

//*****************************************************************************
//
// Register: EVENT_O_UDMACH5SSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// UART1_RX_DMASREQ         UART1 RX DMA single request, controlled by
//                          UART1:DMACTL.RXDMAE
#define EVENT_UDMACH5SSEL_EV_W                                               7
#define EVENT_UDMACH5SSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH5SSEL_EV_S                                               0
#define EVENT_UDMACH5SSEL_EV_UART1_RX_DMASREQ                       0x00000035

//*****************************************************************************
//
// Register: EVENT_O_UDMACH5BSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// UART1_RX_DMABREQ         UART1 RX DMA burst request, controlled by
//                          UART1:DMACTL.RXDMAE
#define EVENT_UDMACH5BSEL_EV_W                                               7
#define EVENT_UDMACH5BSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH5BSEL_EV_S                                               0
#define EVENT_UDMACH5BSEL_EV_UART1_RX_DMABREQ                       0x00000034

//*****************************************************************************
//
// Register: EVENT_O_UDMACH6SSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// UART1_TX_DMASREQ         UART1 TX DMA single request, controlled by
//                          UART1:DMACTL.TXDMAE
#define EVENT_UDMACH6SSEL_EV_W                                               7
#define EVENT_UDMACH6SSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH6SSEL_EV_S                                               0
#define EVENT_UDMACH6SSEL_EV_UART1_TX_DMASREQ                       0x00000037

//*****************************************************************************
//
// Register: EVENT_O_UDMACH6BSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// UART1_TX_DMABREQ         UART1 TX DMA burst request, controlled by
//                          UART1:DMACTL.TXDMAE
#define EVENT_UDMACH6BSEL_EV_W                                               7
#define EVENT_UDMACH6BSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH6BSEL_EV_S                                               0
#define EVENT_UDMACH6BSEL_EV_UART1_TX_DMABREQ                       0x00000036

//*****************************************************************************
//
// Register: EVENT_O_UDMACH7SSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// AUX_DMASREQ              DMA single request event from AUX, configured by
//                          AUX_EVCTL:DMACTL
#define EVENT_UDMACH7SSEL_EV_W                                               7
#define EVENT_UDMACH7SSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH7SSEL_EV_S                                               0
#define EVENT_UDMACH7SSEL_EV_AUX_DMASREQ                            0x00000075

//*****************************************************************************
//
// Register: EVENT_O_UDMACH7BSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// AUX_DMABREQ              DMA burst request event from AUX, configured by
//                          AUX_EVCTL:DMACTL
#define EVENT_UDMACH7BSEL_EV_W                                               7
#define EVENT_UDMACH7BSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH7BSEL_EV_S                                               0
#define EVENT_UDMACH7BSEL_EV_AUX_DMABREQ                            0x00000076

//*****************************************************************************
//
// Register: EVENT_O_UDMACH8SSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// AUX_SW_DMABREQ           DMA sofware trigger from AUX, triggered by
//                          AUX_EVCTL:DMASWREQ.START
#define EVENT_UDMACH8SSEL_EV_W                                               7
#define EVENT_UDMACH8SSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH8SSEL_EV_S                                               0
#define EVENT_UDMACH8SSEL_EV_AUX_SW_DMABREQ                         0x00000074

//*****************************************************************************
//
// Register: EVENT_O_UDMACH8BSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read only selection value
// ENUMs:
// AUX_SW_DMABREQ           DMA sofware trigger from AUX, triggered by
//                          AUX_EVCTL:DMASWREQ.START
#define EVENT_UDMACH8BSEL_EV_W                                               7
#define EVENT_UDMACH8BSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH8BSEL_EV_S                                               0
#define EVENT_UDMACH8BSEL_EV_AUX_SW_DMABREQ                         0x00000074

//*****************************************************************************
//
// Register: EVENT_O_UDMACH9SSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read/write selection value
//
// Writing any other value than values defined by a ENUM may result in
// undefined behavior.
// ENUMs:
// ALWAYS_ACTIVE            Always asserted
// GPT3B_DMABREQ            GPT3B DMA trigger event. Configured by GPT3:DMAEV
// GPT3A_DMABREQ            GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT2B_DMABREQ            GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT2A_DMABREQ            GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT1B_DMABREQ            GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT1A_DMABREQ            GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT0B_DMABREQ            GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT0A_DMABREQ            GPT0A DMA trigger event. Configured by GPT0:DMAEV
// TIE_LOW                  Not used tied to 0
// NONE                     Always inactive
#define EVENT_UDMACH9SSEL_EV_W                                               7
#define EVENT_UDMACH9SSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH9SSEL_EV_S                                               0
#define EVENT_UDMACH9SSEL_EV_ALWAYS_ACTIVE                          0x00000079
#define EVENT_UDMACH9SSEL_EV_GPT3B_DMABREQ                          0x00000054
#define EVENT_UDMACH9SSEL_EV_GPT3A_DMABREQ                          0x00000053
#define EVENT_UDMACH9SSEL_EV_GPT2B_DMABREQ                          0x00000052
#define EVENT_UDMACH9SSEL_EV_GPT2A_DMABREQ                          0x00000051
#define EVENT_UDMACH9SSEL_EV_GPT1B_DMABREQ                          0x00000050
#define EVENT_UDMACH9SSEL_EV_GPT1A_DMABREQ                          0x0000004F
#define EVENT_UDMACH9SSEL_EV_GPT0B_DMABREQ                          0x0000004E
#define EVENT_UDMACH9SSEL_EV_GPT0A_DMABREQ                          0x0000004D
#define EVENT_UDMACH9SSEL_EV_TIE_LOW                                0x00000045
#define EVENT_UDMACH9SSEL_EV_NONE                                   0x00000000

//*****************************************************************************
//
// Register: EVENT_O_UDMACH9BSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read/write selection value
//
// Writing any other value than values defined by a ENUM may result in
// undefined behavior.
// ENUMs:
// ALWAYS_ACTIVE            Always asserted
// GPT3B_DMABREQ            GPT3B DMA trigger event. Configured by GPT3:DMAEV
// GPT3A_DMABREQ            GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT2B_DMABREQ            GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT2A_DMABREQ            GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT1B_DMABREQ            GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT1A_DMABREQ            GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT0B_DMABREQ            GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT0A_DMABREQ            GPT0A DMA trigger event. Configured by GPT0:DMAEV
// NONE                     Always inactive
#define EVENT_UDMACH9BSEL_EV_W                                               7
#define EVENT_UDMACH9BSEL_EV_M                                      0x0000007F
#define EVENT_UDMACH9BSEL_EV_S                                               0
#define EVENT_UDMACH9BSEL_EV_ALWAYS_ACTIVE                          0x00000079
#define EVENT_UDMACH9BSEL_EV_GPT3B_DMABREQ                          0x00000054
#define EVENT_UDMACH9BSEL_EV_GPT3A_DMABREQ                          0x00000053
#define EVENT_UDMACH9BSEL_EV_GPT2B_DMABREQ                          0x00000052
#define EVENT_UDMACH9BSEL_EV_GPT2A_DMABREQ                          0x00000051
#define EVENT_UDMACH9BSEL_EV_GPT1B_DMABREQ                          0x00000050
#define EVENT_UDMACH9BSEL_EV_GPT1A_DMABREQ                          0x0000004F
#define EVENT_UDMACH9BSEL_EV_GPT0B_DMABREQ                          0x0000004E
#define EVENT_UDMACH9BSEL_EV_GPT0A_DMABREQ                          0x0000004D
#define EVENT_UDMACH9BSEL_EV_NONE                                   0x00000000

//*****************************************************************************
//
// Register: EVENT_O_UDMACH10SSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read/write selection value
//
// Writing any other value than values defined by a ENUM may result in
// undefined behavior.
// ENUMs:
// ALWAYS_ACTIVE            Always asserted
// GPT3B_DMABREQ            GPT3B DMA trigger event. Configured by GPT3:DMAEV
// GPT3A_DMABREQ            GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT2B_DMABREQ            GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT2A_DMABREQ            GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT1B_DMABREQ            GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT1A_DMABREQ            GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT0B_DMABREQ            GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT0A_DMABREQ            GPT0A DMA trigger event. Configured by GPT0:DMAEV
// TIE_LOW                  Not used tied to 0
// NONE                     Always inactive
#define EVENT_UDMACH10SSEL_EV_W                                              7
#define EVENT_UDMACH10SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH10SSEL_EV_S                                              0
#define EVENT_UDMACH10SSEL_EV_ALWAYS_ACTIVE                         0x00000079
#define EVENT_UDMACH10SSEL_EV_GPT3B_DMABREQ                         0x00000054
#define EVENT_UDMACH10SSEL_EV_GPT3A_DMABREQ                         0x00000053
#define EVENT_UDMACH10SSEL_EV_GPT2B_DMABREQ                         0x00000052
#define EVENT_UDMACH10SSEL_EV_GPT2A_DMABREQ                         0x00000051
#define EVENT_UDMACH10SSEL_EV_GPT1B_DMABREQ                         0x00000050
#define EVENT_UDMACH10SSEL_EV_GPT1A_DMABREQ                         0x0000004F
#define EVENT_UDMACH10SSEL_EV_GPT0B_DMABREQ                         0x0000004E
#define EVENT_UDMACH10SSEL_EV_GPT0A_DMABREQ                         0x0000004D
#define EVENT_UDMACH10SSEL_EV_TIE_LOW                               0x00000046
#define EVENT_UDMACH10SSEL_EV_NONE                                  0x00000000

//*****************************************************************************
//
// Register: EVENT_O_UDMACH10BSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read/write selection value
//
// Writing any other value than values defined by a ENUM may result in
// undefined behavior.
// ENUMs:
// ALWAYS_ACTIVE            Always asserted
// GPT3B_DMABREQ            GPT3B DMA trigger event. Configured by GPT3:DMAEV
// GPT3A_DMABREQ            GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT2B_DMABREQ            GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT2A_DMABREQ            GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT1B_DMABREQ            GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT1A_DMABREQ            GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT0B_DMABREQ            GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT0A_DMABREQ            GPT0A DMA trigger event. Configured by GPT0:DMAEV
// NONE                     Always inactive
#define EVENT_UDMACH10BSEL_EV_W                                              7
#define EVENT_UDMACH10BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH10BSEL_EV_S                                              0
#define EVENT_UDMACH10BSEL_EV_ALWAYS_ACTIVE                         0x00000079
#define EVENT_UDMACH10BSEL_EV_GPT3B_DMABREQ                         0x00000054
#define EVENT_UDMACH10BSEL_EV_GPT3A_DMABREQ                         0x00000053
#define EVENT_UDMACH10BSEL_EV_GPT2B_DMABREQ                         0x00000052
#define EVENT_UDMACH10BSEL_EV_GPT2A_DMABREQ                         0x00000051
#define EVENT_UDMACH10BSEL_EV_GPT1B_DMABREQ                         0x00000050
#define EVENT_UDMACH10BSEL_EV_GPT1A_DMABREQ                         0x0000004F
#define EVENT_UDMACH10BSEL_EV_GPT0B_DMABREQ                         0x0000004E
#define EVENT_UDMACH10BSEL_EV_GPT0A_DMABREQ                         0x0000004D
#define EVENT_UDMACH10BSEL_EV_NONE                                  0x00000000

//*****************************************************************************
//
// Register: EVENT_O_UDMACH11SSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read/write selection value
//
// Writing any other value than values defined by a ENUM may result in
// undefined behavior.
// ENUMs:
// ALWAYS_ACTIVE            Always asserted
// GPT3B_DMABREQ            GPT3B DMA trigger event. Configured by GPT3:DMAEV
// GPT3A_DMABREQ            GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT2B_DMABREQ            GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT2A_DMABREQ            GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT1B_DMABREQ            GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT1A_DMABREQ            GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT0B_DMABREQ            GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT0A_DMABREQ            GPT0A DMA trigger event. Configured by GPT0:DMAEV
// TIE_LOW                  Not used tied to 0
// NONE                     Always inactive
#define EVENT_UDMACH11SSEL_EV_W                                              7
#define EVENT_UDMACH11SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH11SSEL_EV_S                                              0
#define EVENT_UDMACH11SSEL_EV_ALWAYS_ACTIVE                         0x00000079
#define EVENT_UDMACH11SSEL_EV_GPT3B_DMABREQ                         0x00000054
#define EVENT_UDMACH11SSEL_EV_GPT3A_DMABREQ                         0x00000053
#define EVENT_UDMACH11SSEL_EV_GPT2B_DMABREQ                         0x00000052
#define EVENT_UDMACH11SSEL_EV_GPT2A_DMABREQ                         0x00000051
#define EVENT_UDMACH11SSEL_EV_GPT1B_DMABREQ                         0x00000050
#define EVENT_UDMACH11SSEL_EV_GPT1A_DMABREQ                         0x0000004F
#define EVENT_UDMACH11SSEL_EV_GPT0B_DMABREQ                         0x0000004E
#define EVENT_UDMACH11SSEL_EV_GPT0A_DMABREQ                         0x0000004D
#define EVENT_UDMACH11SSEL_EV_TIE_LOW                               0x00000047
#define EVENT_UDMACH11SSEL_EV_NONE                                  0x00000000

//*****************************************************************************
//
// Register: EVENT_O_UDMACH11BSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read/write selection value
//
// Writing any other value than values defined by a ENUM may result in
// undefined behavior.
// ENUMs:
// ALWAYS_ACTIVE            Always asserted
// GPT3B_DMABREQ            GPT3B DMA trigger event. Configured by GPT3:DMAEV
// GPT3A_DMABREQ            GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT2B_DMABREQ            GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT2A_DMABREQ            GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT1B_DMABREQ            GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT1A_DMABREQ            GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT0B_DMABREQ            GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT0A_DMABREQ            GPT0A DMA trigger event. Configured by GPT0:DMAEV
// NONE                     Always inactive
#define EVENT_UDMACH11BSEL_EV_W                                              7
#define EVENT_UDMACH11BSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH11BSEL_EV_S                                              0
#define EVENT_UDMACH11BSEL_EV_ALWAYS_ACTIVE                         0x00000079
#define EVENT_UDMACH11BSEL_EV_GPT3B_DMABREQ                         0x00000054
#define EVENT_UDMACH11BSEL_EV_GPT3A_DMABREQ                         0x00000053
#define EVENT_UDMACH11BSEL_EV_GPT2B_DMABREQ                         0x00000052
#define EVENT_UDMACH11BSEL_EV_GPT2A_DMABREQ                         0x00000051
#define EVENT_UDMACH11BSEL_EV_GPT1B_DMABREQ                         0x00000050
#define EVENT_UDMACH11BSEL_EV_GPT1A_DMABREQ                         0x0000004F
#define EVENT_UDMACH11BSEL_EV_GPT0B_DMABREQ                         0x0000004E
#define EVENT_UDMACH11BSEL_EV_GPT0A_DMABREQ                         0x0000004D
#define EVENT_UDMACH11BSEL_EV_NONE                                  0x00000000

//*****************************************************************************
//
// Register: EVENT_O_UDMACH12SSEL
//
//*****************************************************************************
// Field:   [6:0] EV
//
// Read/write selection value
//
// Writing any other value than values defined by a ENUM may result in
// undefined behavior.
// ENUMs:
// ALWAYS_ACTIVE            Always asserted
// GPT3B_DMABREQ            GPT3B DMA trigger event. Configured by GPT3:DMAEV
// GPT3A_DMABREQ            GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT2B_DMABREQ            GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT2A_DMABREQ            GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT1B_DMABREQ            GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT1A_DMABREQ            GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT0B_DMABREQ            GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT0A_DMABREQ            GPT0A DMA trigger event. Configured by GPT0:DMAEV
// TIE_LOW                  Not used tied to 0
// NONE                     Always inactive
#define EVENT_UDMACH12SSEL_EV_W                                              7
#define EVENT_UDMACH12SSEL_EV_M                                     0x0000007F
#define EVENT_UDMACH12SSEL_EV_S                                              0
#define EVENT_UDMACH12SSEL_EV_ALWAYS_ACTIVE                         0x00000079
#define EVENT_UDMACH12SSEL_EV_GPT3B_DMABREQ                         0x00000054
#define EVENT_UDMACH12SSEL_EV_GPT3A_DMABREQ                         0x00000053
#define EVENT_UDMACH12SSEL_EV_GPT2B_DMABREQ                         0x00000052
#define EVENT_UDMACH12SSEL_EV_GPT2A_DMABREQ                         0x00000051
#define EVENT_UDMACH12SSEL_EV_GPT1B_DMABREQ                         0x00000050
#define EVENT_UDMACH12SSEL_EV_GPT1A_DMABREQ                         0x0000004F
#define EVENT_UDMACH12SSEL_EV_GPT0B_DMABREQ                         0x0000004E
#define EVENT_UDMACH12SSEL_EV_GPT0A_DMABREQ                         0x0000004D
#define EVENT_UDMACH12SSEL_EV_TIE_LOW                               0x00000048
#define EVENT_UDMACH12SSEL_EV_NONE                                  0x00000000

